[{"name":"Leaving Time","price":200,"credits":4,"describe":"This book might be a little difficult, since it’s not a typical thriller. It’s focused more on how people think than on their actions. More advanced readers will enjoy this one.","img":"https://images-na.ssl-images-amazon.com/images/I/51awyZJCrfL.jpg"},{"name":"1st to Die","price":594,"credits":5,"describe":"Patterson’s writing is fairly easy to understand, and has tons of great action words to learn.","img":"https://images-na.ssl-images-amazon.com/images/I/51udawWvXIL.jpg"},{"name":"Three","price":2007,"credits":3,"describe":"The writing in this book is about as easy as Patterson’s writing, but the story might be a little more difficult to follow.","img":"https://images-na.ssl-images-amazon.com/images/I/517CXMgdwEL.jpg"},{"name":"Mr. Mercedes","price":2060,"credits":8,"describe":"Stephen King is one of the best-known authors in the horror (scary story) genre today. His language is a little more advanced, and his characters are very realistic, which makes this a good book for seeing how people talk.","img":"https://images-na.ssl-images-amazon.com/images/I/51iTSKUkpFL.jpg"},{"name":"Silent Scream","price":116,"credits":16,"describe":"This book is a little more advanced in its writing style, but it should still be readable for high-intermediate level learners. Marsons is a British author, so some of the language and dialogue are specific to Britain (like calling people “guv”). This is a great book for learning “Britishisms”—ways of speaking that are specific to the UK","img":"https://images-na.ssl-images-amazon.com/images/I/51J44lEfCbL.jpg"},{"name":"Until the end of time","price":2500,"credits":9,"describe":" The writing in this book is a little verbose (it uses a lot of words), but the language is simple enough for an intermediate learner to follow.","img":"https://images-na.ssl-images-amazon.com/images/I/5103BfupPSL.jpg"},{"name":"One of the MOney","price":800,"credits":56,"describe":"Fast-paced and easy to follow, this is a great book for intermediate readers. The book is written from the point of view of the main character, and it uses a very conversational tone. It’s written the way Stephanie Plum would actually speak. Perfect for learning how native English speakers talk!","img":"https://images-na.ssl-images-amazon.com/images/I/51K9TEy8QHL.jpg"},{"name":"Sincerely, Carter","price":2007,"credits":10,"describe":"This is a fun, simple book that uses realistic conversations and moments. It’s told from a man’s point of view, making it different from many other romance novels.","img":"https://images-na.ssl-images-amazon.com/images/I/51IqJkWOncL.jpg"}]